while True:
    print("ты находишься в подвале, перед тобой 3 пути")
    print("путь из которого можно выбраться - не крайний, в какой пройдёшь? (от 1 до 3)")
    print("есть пасхалка (угадаешь красава)")
    sos = input()
    if sos == "1":
        print("у ты в канаве")
        continue
    elif sos == "3":
        print("ТЫ ПОПАЛ В ЛОГОВО ЗЛОДЕЯ БОСИНА >:))) Game over...")
        continue
    elif  sos == "6":
        print("хамстер хамстер хамстер криминал")
        continue
    elif sos == "зверя нет сильней китайца старый бог соси нам яйца":
        print("БРАТАН ТЫ ШАРИШЬ")
        continue
    elif sos == "tarelOchka66":
        print("боже ботиха >;)")
        continue
    if sos == "2":
        print("ты во 2 пути")
        print("а тут ещё 2, в какой пойдешь?")
        print("справа или слева?")
    if sos in ("1", "2", "3", "6"):
        break
    print("блин, что это, введи ещё раз")
while sos == '2':
    shmf = input()
    if shmf == "справа":
        print("за этим путём поджидал поднебесный, который выебал тебя)")
        continue
    elif shmf == "слева":
        print("УРА СВОБОДА, иди в доту играй умник")
    if shmf in ("слева", "справа"):
        break
        print("блин, что это, введи ещё раз")
    print("блин, что это, введи ещё раз")